console.log ('number' + 3 + 3);
/* 
1. Конкатинація: стрінга і число складаються та утворюють стрінгу "number3"
2. Знову конкатинація: Стрінга і число складаються та утворюють стрінгу "number33"
Результат: number33
*/
console.log (null + 3);
/*
1. Математична операція додавання перетворює null на 0
2. До 0 додаємо 3 і отримуємо результат 3
Результат: 3
*/
console.log (5 && 'qwerty');
/* 
1. Оператор && перевіряє ліве значення: воно правдиве.
2. Оперетор && перевіряє праве значення: воно теж правдиве.
3. Оскільки значень більше немає, повертається останнє значення.
Результат: qwerty
*/
console.log (+'40' + +'2' + "hillel");
/* 
1. Унарний плюс перетворює стрінгу "40" на число
2. Унарнй плюс пертворює рядок "2" на число
3. 40+2=42
4. 42 + 'hillel' -> конкатинація
Результат: 42hillel
*/
console.log ('10' - 5 === 6);
/* 
1. Математичний оператор "-" перетворює раядок "10" на число
2. 10-5=5
3. Оскільки 5 != 6, суворе порівняння видає результат false 
Результат: false 
*/
console.log (true + false);
/* 
1. Математичний оператор "+" перетворює булеве значення true на одиницю
2. false перетворюється на 0
3. 0 + 1 = 1
Результат: 1
*/
console.log('4px' - 3);
/* 
1. Маткматичний оператор "-" перетворює стрінгу на число
2. Оскільки в стрінзі є літери, ми отримуємо NaN 
3. Будь яка математична операція з NaN повертає NaN 
Результат: NaN 
*/
console.log('4' - 3);
/* 
1. Математичний оператор перетворює стрінгу на число
4 - 3 = 1
Результат: 1
*/
console.log ('6' + 3 ** 0);
/* 
1. Оператор піднесення до степеня має вищий пріорітет, тому 3 ** 0 = 1
2. "6" + 1 -> конкатинація 
Результат: 61
*/
console.log (12 / '6');
/* 
1. Оператор ділення "/" перетворює рядок на число
2. 12 / 6 = 2
Результат: 2
*/
console.log ('10' + (5 === 6));
/* 
1. Вираз в дужках має вищий пріортет і виконується першим: 5 === 6 -> false
2. '10' + false -> конкатинація 
Результат: 10false
*/ 
console.log (null == '');
/* 
1. При нестрогому прорівнянні null дорівнює undefined і самому собі.
2. null не приводиться до порожнього рядка чи 0
Результат: false 
*/
console.log (3 ** (9 / 3));
/*
1. Дія в дужках має пріорітет: 9 / 3 = 3
2. 3 ** 3 (3 у 3 степерні) = 27
Результат: 27
*/
console.log (!!'false' == !!'true');
/*
1. Оператор ! перетворює значення на булевий тип та інвертує його. 
У нашому випадку їх два, тому відбувається подвійна інверсія. 'false' не пустий
рядок, тому він має значення true. Першиий ! перетворює true на false, а другий
повертає назад у true.
2. true за тим самим принципом має значення true 
3 true == true
Результат: true 
*/
console.log(0 || '0' && 1);
/*
1. Оператор && має вищий пріорітет за || тому виконується '0' && 1
2. Оскільки '0' - не порожній рядок (true), to оператор && повертає останнє значення
3. Виконується 0 || 1. Оскільки 0 - неправдиве значення (false), оператор || повертає 1
Результат: 1
*/
console.log ((+null == false) < 1);
/*
1. Унарний плюс перетворює null на число 0
2. 0 == false -> при нестрогому порівнянні false перетворюється на 0. 0 == 0 дає true 
3. true < 1 -> при порівнянні true стає 1. 1 < 1 дає false. 
Результат: false 
*/
console.log(false && true || true);
/*
1. && має вищий приорітет. false && true дає false оскільки це неправдиве значення, а оператор && шукає саме його
2. false || true дає true оскільки оператор || шукає правдве значення
Результат: true 
*/
console.log (false && (false || true));
/*
1. Дужки мають вищій приорітет. false || true -> true 
2. false && true -> false
Результат: false 
*/
console.log ((+null == false) < 1 ** 5);
/*
1. Підвищення до степеня ** має вищий пріорітет. 1 ** 5 = 1
2. Далі дужки. +null перетворюється на 0. 0 == false -> true
3. true < 1/ При порівнянні true перетворюється на 1. 1 < 1 -> false
Результат: false 
*/